Kyderio/arduino_test/Arduino_package/hardware/system/component/wifi/wifi_fw/amebasmart/include/RTL8730E_autoconf.h
#ifndef _AUTOCONF_H_
#define _AUTOCONF_H_

/*--------------------------Define -------------------------------------------*/
/*powersave*/
#define CONFIG_BCNEARLY_FIXED			1
#define CONFIG_LPS_I_TWT				0
#define CONFIG_S1_NULL1_IVL_PATCH		1
#define CONFIG_SWBB_PERIOD_CCA			0
#define CONFIG_HWMAC_PERIOD_CCA			0
#define CONFIG_BEACON_MODE				0
#define CONFIG_LPS_Normal				0
#define CONFIG_LPS_Offload				1
#define CONFIG_BCNRXWINDOW_ADJUST   	0
#define CONFIG_LPS_TIME_LOG   	        0
#define CONFIG_PHYSTS_BUF		        1
#define CONFIG_CHINFO_BUF               1
#define CONFIG_LEAK_AP					0
#define CONFIG_RX_BCN_CNT				0
#define CONFIG_RECORD_TSF				0
#define CONFIG_RF_OFF_BY_EDCCA			0
#define CONFIG_MULTI_RX_BCN             0

/*PHY Dynamic*/
#define RA_V3
#define CONFIG_NEW_RATE_ADAPTIVE		1
#define CONFIG_H2C_LOGO					0
#define CONFIG_DIG_OFFLOAD				0

/*WOWLAN*/
#define CONFIG_BroadDHCP_WAKE			0


/*BTCOEX*/
#define BREDR_SUPPORT					1
#define LE_AUDIO_SUPPORT				1
#define CONFIG_BTCOEX_SLOT_DEBUG		0    //CONFIG_BTCOEX

/*verification*/
#define CONFIG_FPGA_TEST			1
#define CONFIG_DV_SIMULATION_TEST		0

/*MISC*/
#define CONFIG_CSI_REPORT					1
#define CONFIG_PS_TIMER_KEEP_ALIVE			1
/*include rx filter setting, enable after dplus IC*/
#define CONFIG_ADDR_CAM_SUPPORT                     0

/*patch macro block*/
#define PHYSTS_CHINFO_WPTR_BINDING_MACTRX_PATCH
/*for special AP behavior patch configs start*/
#define CONFIG_CONSTANT_ARPREQ_POWERSAVE_PATCH 0
/*for special AP behavior patch configs  end*/
#define CONFIG_TSFT_PATCH			    0

#endif  /* #ifndef _AUTOCONF_H_ */
